---
title: EdgeEndPoint
classe: Autodesk.Revit.DB.EdgeEndPoint
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# EdgeEndPoint

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Edge Edge { get; }` | `edgeEndPoint.Edge` | Edge |
| `Int32 Index { get; }` | `edgeEndPoint.Index` | Int32 |
| `Boolean IsValidObject { get; }` | `edgeEndPoint.IsValidObject` | Boolean |
| `Void Dispose()` | `edgeEndPoint.Dispose()` | Void |
| `XYZ Evaluate()` | `edgeEndPoint.Evaluate()` | XYZ |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```